// Exit_Confirm.cpp : 实现文件
//

#include "stdafx.h"
#include "Server_Data.h"
#include "Exit_Confirm.h"


// CExit_Confirm 对话框

IMPLEMENT_DYNAMIC(CExit_Confirm, CDialog)

//------------------------------------------------------------------------------------------------------			
//	函数功能：构造函数
//------------------------------------------------------------------------------------------------------
CExit_Confirm::CExit_Confirm(CWnd* pParent /*=NULL*/)
	: CDialog(CExit_Confirm::IDD, pParent)
{

}

//------------------------------------------------------------------------------------------------------			
//	函数功能：析构函数
//------------------------------------------------------------------------------------------------------
CExit_Confirm::~CExit_Confirm()
{
}

//------------------------------------------------------------------------------------------------------			
//	函数功能：屏幕数据映射
//------------------------------------------------------------------------------------------------------
void CExit_Confirm::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_EDIT1, m_cPassword);
}


//------------------------------------------------------------------------------------------------------			
//	函数功能：屏幕消息映射
//------------------------------------------------------------------------------------------------------
BEGIN_MESSAGE_MAP(CExit_Confirm, CDialog)
	ON_BN_CLICKED(IDOK, &CExit_Confirm::OnBnClickedOk)
END_MESSAGE_MAP()


// CExit_Confirm 消息处理程序

//------------------------------------------------------------------------------------------------------			
//	函数功能：对话窗初始化
//------------------------------------------------------------------------------------------------------
BOOL CExit_Confirm::OnInitDialog()
{
	CDialog::OnInitDialog();

	// TODO:  在此添加额外的初始化

	return TRUE;  // return TRUE unless you set the focus to a control
	// 异常: OCX 属性页应返回 FALSE
}

//------------------------------------------------------------------------------------------------------			
// 消息预处理：把回车键变换为TAB
//------------------------------------------------------------------------------------------------------			
BOOL CExit_Confirm::PreTranslateMessage(MSG* pMsg)
{
	// TODO: 在此添加专用代码和/或调用基类
	if (pMsg->message==WM_KEYDOWN && pMsg->wParam==VK_RETURN)
	{
		CDialog* Pwnd=(CDialog*)GetActiveWindow();						//取得对话框指针 
		Pwnd->NextDlgCtrl();											//切换到下一个输入焦点 
		return true;
	}

	return CDialog::PreTranslateMessage(pMsg);
}

//------------------------------------------------------------------------------------------------------			
// 消息预处理：把回车键变换为TAB
//------------------------------------------------------------------------------------------------------			
void CExit_Confirm::OnBnClickedOk()
{
	// TODO: 在此添加控件通知处理程序代码
	CString	v_sTemp;													//临时变量

	m_cPassword.GetWindowText(v_sTemp);
	if (v_sTemp=="Server_Data")
		OnOK();
	else
	{
		MessageBox("密码错误，请重新输入  ！！！");						//窗体提示
		m_cPassword.SetFocus();											//聚焦
	}
}

//------------------------------------------------------------------------------------------------------			
//	END
//------------------------------------------------------------------------------------------------------
