#pragma once
#include "Server_Data.h"

class CMyFilter
{
public:
	CMyFilter(void);
	~CMyFilter(void);
	//------------------------------------------------------------------------------------------------------
	//	成员变量：
	//------------------------------------------------------------------------------------------------------
	map<CString,map_Counter>       cell_information_;                                  //小区及其所属区域；在网状态
	//------------------------------------------------------------------------------------------------------
	//	成员函数：
	//------------------------------------------------------------------------------------------------------
	void FilterNonDalianCell(map_ObjType &cell_objtype);                               //过滤非大连小区
	bool JudgeEngineeringCell(CString cell_name);                                      //判断小区状态；工程返回false
	void GetCell();                                                                    //获得小区；区域及在网状态
	void Init();                                                                       //类功能初始化
};

